In [1]:
import pandas as pd

In [4]:
dict = {
    
    'name' : ['a','b','c','d','a','a','b','c','a','b','c'],
    's1' : [12,13,14,12,13,14,15,16,10,25,23],
    's2' : [23,24,25,12,13,14,15,16,10,25,23]
}

var = pd.DataFrame(dict)
var

   name  s1  s2
0     a  12  23
1     b  13  24
2     c  14  25
3     d  12  12
4     a  13  13
5     a  14  14
6     b  15  15
7     c  16  16
8     a  10  10
9     b  25  25
10    c  23  23

In [9]:
var_new = var.groupby('name')
var_new

In [10]:
for x,y in var_new:
    print(x)
    print(y)

a
  name  s1  s2
0    a  12  23
4    a  13  13
5    a  14  14
8    a  10  10
b
  name  s1  s2
1    b  13  24
6    b  15  15
9    b  25  25
c
   name  s1  s2
2     c  14  25
7     c  16  16
10    c  23  23
d
  name  s1  s2
3    d  12  12

In [12]:
var_new.get_group('c')

   name  s1  s2
2     c  14  25
7     c  16  16
10    c  23  23

In [13]:
var_new.min()

      s1  s2
name
a     10  10
b     13  15
c     14  16
d     12  12

In [14]:
l = list(var_new)
l

[('a',
    name  s1  s2
  0    a  12  23
  4    a  13  13
  5    a  14  14
  8    a  10  10),
 ('b',
    name  s1  s2
  1    b  13  24
  6    b  15  15
  9    b  25  25),
 ('c',
     name  s1  s2
  2     c  14  25
  7     c  16  16
  10    c  23  23),
 ('d',
    name  s1  s2
  3    d  12  12)]